# Project 2 Part 3B
**Transform and Load**


*Christina Brockway*

### Task
- Take the cleaned data and add stakeholder data to SQL database
- Genres
    -  use title basics from part 1
    -  extract and normalize column
- New Table from API calls
    -  Tmdb_data table
        -  imdb_id
        -  revenue
        -  budget
        -  certification

### Imports

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json, os
import plotly.express as px
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy.types import *

In [2]:
#Mysql login
with open("/Users/csbro/.secret/mysql.json", "r") as f:
          login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

### Load data and Inspect

In [3]:
df = pd.read_csv('data/basics-filtered.csv')

In [4]:
df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

## Normalize Data

### Generes

In [6]:
# screate a new column with a list of genres
df['genres_split']= df['genres'].str.split(",")
df.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [7]:
#Seperate list of genres
exploded_genres = df.explode('genres_split')
exploded_genres.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy

In [8]:
#get unique genres from the split
unique_genres =  sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [9]:
# Create new table for title_genres
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head(2)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy

In [10]:
#Create a gene mapper dictionary
genre_init = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_init))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [11]:
#Add genres_id column
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
#Drop genres split column
title_genres = title_genres.drop(columns='genres_split')
title_genres.head(2)

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9

### Genres Dataframe

In [12]:
#Make a dataframe with named cols from the keys and values
genres = pd.DataFrame({"genre_name": genre_map.keys(),
                             "genre_id": genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Create DB and Normalize/Transform

### tmdb_data table Created Using Python

#### Load tmdb_data

In [13]:
#create connection with MySQL

#Define database
dbase = 'movies'

# Define your login credentials
username = login["username"]
password = login["password"]

# Create the connection string
connection = f'mysql+pymysql://{username}:{password}@localhost/{dbase}'

# Create the database engine
engine = create_engine(connection)

# Connect to the database
engine = engine.connect()

In [14]:
tmdbdf = pd.read_csv('MovieData/tmdb_results_combined.csv.gz')

In [15]:
tmdbdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 696 entries, 0 to 695
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                696 non-null    object
 1   adult                  696 non-null    float64
 2   backdrop_path          570 non-null    object
 3   belongs_to_collection  112 non-null    object
 4   budget                 696 non-null    float64
 5   genres                 696 non-null    object
 6   homepage               104 non-null    object
 7   id                     696 non-null    float64
 8   original_language      696 non-null    object
 9   original_title         696 non-null    object
 10  overview               692 non-null    object
 11  popularity             696 non-null    float64
 12  poster_path            666 non-null    object
 13  production_companies   696 non-null    object
 14  production_countries   696 non-null    object
 15  release_date           694 non-null    object
 16  revenue                696 non-null    float64
 17  runtime                696 non-null    float64
 18  spoken_languages       696 non-null    object
 19  status                 696 non-null    object
 20  tagline                522 non-null    object
 21  title                  696 non-null    object
 22  video                  696 non-null    float64
 23  vote_average           696 non-null    float64
 24  vote_count             696 non-null    float64
 25  certification          454 non-null    object
dtypes: float64(9), object(17)
memory usage: 141.5+ KB

In [16]:
#Defining Columns
data = {'tconst': [],
    'revenue': [],
    'budget': [],
    'certification':[]}

#create datafrome
tmdb_df = pd.DataFrame(data)
tmdb_df

Empty DataFrame
Columns: [tconst, revenue, budget, certification]
Index: []

In [17]:
tmdbdf = tmdbdf[['imdb_id', 'revenue', "budget", 'certification']]
tmdbdf.head(2)

     imdb_id     revenue      budget certification
0  tt0035423  76019048.0  48000000.0         PG-13
1  tt0118589   5271666.0  22000000.0         PG-13

#### Create tmdb_data table

In [18]:
tmdbdf = tmdbdf.rename(columns={'imdb_id': 'tconst'})
tmdbdf.head(2)

      tconst     revenue      budget certification
0  tt0035423  76019048.0  48000000.0         PG-13
1  tt0118589   5271666.0  22000000.0         PG-13

In [19]:
## Make a dictionary with column and datatypes
tmdb_types = {'tconst':CHAR(15),
              'revenue':FLOAT(),
              'budget':FLOAT(),
              'certification':VARCHAR(10)}
tmdb_types

{'tconst': CHAR(length=15),
 'revenue': FLOAT(),
 'budget': FLOAT(),
 'certification': VARCHAR(length=10)}

### Load Data Into Tables

In [20]:
genres.to_sql('genres', engine, dtype=tmdb_types,
               if_exists='replace', index=False)

25

In [21]:
#Save to SQL with dtype

title_genres.to_sql('title_genres', engine, dtype=tmdb_types,
               if_exists="replace", index=False)

162600

In [22]:
q="""
SHOW TABLES;
"""
pd.read_sql(q, engine)

  Tables_in_movies
0           basics
1           genres
2          ratings
3     title_genres

In [23]:
#display \basics info
q = """
DESCRIBE basics;
"""

pd.read_sql(q, engine)

,Field,Type,Null,Key,Default,Extra
0,tconst,char(15),NO,PRI,None,
1,primary_title,varchar(250),YES,,None,
2,start_year,float,YES,,None,
3,runtime_mins,int,YES,,None,
4,created_date,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_date,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [24]:
#confirm data has been added
q= """
SELECT * FROM basics
LIMIT 5;
"""
pd.read_sql(q, engine)

,tconst,primary_title,start_year,runtime_mins,created_date,updated_date
0,tt0035423,Kate & Leopold,2001.0,118,2023-11-11 15:51:26,2023-11-11 15:51:26
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,2023-11-11 15:51:26,2023-11-11 15:51:26
2,tt0069049,The Other Side of the Wind,2018.0,122,2023-11-11 15:51:26,2023-11-11 15:51:26
3,tt0088751,The Naked Monster,2005.0,100,2023-11-11 15:51:26,2023-11-11 15:51:26
4,tt0096056,Crime and Punishment,2002.0,126,2023-11-11 15:51:26,2023-11-11 15:51:26

In [25]:
#basics.to_csv(f"MovieData/basics_data3B.csv.gz", compression = 'gzip', index=False)

##### ratings

In [26]:
#read in data from ratings
ratings_data = pd.read_csv('MovieData/ratings_data.csv.gz')

In [27]:
#Load ratings table
ratings_data.to_sql("ratings", engine, index=False, if_exists='append')

71900

In [28]:
#display ratings db info
q = """
DESCRIBE ratings;
"""

pd.read_sql(q, engine)

        Field    Type Null Key Default Extra
0      tconst    text  YES        None
1  avg_rating  double  YES        None
2   num_votes  bigint  YES        None

In [29]:
#confirm data has been added
q= """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  avg_rating  num_votes
0  tt0035423         6.4      87153
1  tt0062336         6.4        175
2  tt0069049         6.7       7754
3  tt0088751         5.2        336
4  tt0096056         5.6        846

In [30]:
#ratings_data.to_csv(f"MovieData/ratings_data3B.csv.gz", compression = 'gzip', index=False)

#### Genres

In [31]:
#display genres db info
q = """
DESCRIBE genres;
"""

pd.read_sql(q, engine)

        Field    Type Null Key Default Extra
0  genre_name    text  YES        None
1    genre_id  bigint  YES        None

In [32]:
#confirm data has been added
q= """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [33]:
#genres.to_csv(f"MovieData/genres3B.csv.gz", compression = 'gzip', index=False)

##### title_genres

In [34]:
#display title_genres db info
q = """
DESCRIBE title_genres;
"""

pd.read_sql(q, engine)

       Field      Type Null Key Default Extra
0     tconst  char(15)  YES        None
1  genres_id    bigint  YES        None

In [35]:
#confirm data has been added
q= """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst  genres_id
0  tt0035423          5
1  tt0035423          9
2  tt0035423         18
3  tt0062336          7
4  tt0069049          7

In [36]:
#title_genres.to_csv(f"MovieData/title_genres3B.csv.gz", compression = 'gzip', index=False)

##### tmdb_data

In [37]:
tmdbdf.to_sql("tmdb_data", engine, index=False, if_exists='append')

696

In [38]:
#display tmdb_data db info
q = """
DESCRIBE tmdb_data;
"""

pd.read_sql(q, engine)

           Field    Type Null Key Default Extra
0         tconst    text  YES        None
1        revenue  double  YES        None
2         budget  double  YES        None
3  certification    text  YES        None

In [39]:
#confirm data has been added
q= """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q, engine)

      tconst     revenue      budget certification
0  tt0035423  76019048.0  48000000.0         PG-13
1  tt0118589   5271666.0  22000000.0         PG-13
2  tt0118652         0.0   1000000.0             R
3  tt0119004      6297.0         0.0          None
4  tt0120681  74558115.0  35000000.0             R